package com.pharmacy.pharmacy.entity;

public enum SymptomsName {
  ГОЛОВНИЙ_БІЛЬ("головний біль"),
  ЗУБНИЙ_БІЛЬ("зубний біль"),
  БІЛЬ_У_СПИНІ("біль у спині"),
  СПАЗМИ_У_ЖИВОТІ("спазми у животі"),
  М_ЯЗОВИЙ_БІЛЬ("м'язовий біль"),
  БІЛЬ_У_ГОРЛІ("біль у горлі"),
  ТЕМПЕРАТУРА("температура"),
  НУДОТА("нудота"),
  БЛЮВАННЯ("блювання"),
  ЗАПАМОРОЧЕННЯ("запаморочення"),
  АЛЕРГІЯ("алергія"),
  ГЕРПЕТИЧНІ_ВИСИПАННЯ("герпетичні висипання"),
  ПЕЧІЯ("печія"),
  СВЕРБІЖ("свербіж"),
  БЕЗСОННЯ("безсоння"),
  ТРИВОГА("тривога"),
  СТРЕС("стрес"),
  БАКТЕРІАЛЬНІ_ІНФЕКЦІЇ("бактеріальні інфекції"),
  ВІРУСНІ_ІНФЕКЦІЇ("вірусні інфекції"),
  ПІДВИЩЕНИЙ_АРТЕРІАЛЬНИЙ_ТИСК("впідвищений артеріальний тиск"),
  ДРАТІВЛИВІСТЬ("дратівливість");

  public String name;

  SymptomsName(String name) {
    this.name = name;
  }


}
