package com.pharmacy.pharmacy.enums;

public enum GroupName {
  ЖАРОЗНИЖУЮЧІ("жарознижуючі"),
  ЗНЕБОЛЮЮЧІ("знеболюючі"),
  СПАЗМОЛІТИКИ("спазмолітики"),
  АНТИГІСТАМІННІ("антигістамінні"),
  СОРБЕНТИ("сорбенти"),
  ПРОТИЗАПАЛЬНІ("протизапальні"),
  АНТИБІОТИКИ("антибіотики"),
  ПРОТИВІРУСНІ("противірусні"),
  АНТИГІПЕРТЕНЗИВНІ("антигіпертензивні"),
  СЕДАТИВНІ("седативні"),
  СНОДІЙНІ("снодійні"),
  АНТИСЕПТИКИ("антисептики");

  public final String name;

  GroupName(String name) {
    this.name = name;
  }
}
